<a href="https://colab.research.google.com/github/Mildredkulei7/Moringa_prep_w2/blob/main/Copy_of_SQL_Programming_Inner_Joins.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<font color="green">*To start working on this notebook, or any other notebook that we will use in the Moringa Data Science Course, we will need to save our own copy of it. We can do this by clicking File > Save a Copy in Drive. We will then be able to make edits to our own copy of this notebook.*</font>

# SQL Programming - Inner Joins

## 1.0 Lets connect to our Database

In [1]:
# We will first load the sql extension into our environment
%load_ext sql

# Then connect to our in memory sqlite database
# NB: This database will cease to exist as soon as the database connection is closed. 
%sql sqlite://

'Connected: @None'

In [2]:
# Importing Pandas
import pandas as pd

## 1.1 Loading our Datasets

Datasets used in this notebook:


1.   **Countries**

> Dataset of European Countries. ([Dataset Download Link](https://drive.google.com/a/moringaschool.com/file/d/1Vz0URHRmUsG17fpzWa02RsCBI2TbPXeV/view?usp=sharing))

2.   **Cities** 

> Dataset of European Cities. ([Dataset Download Link](https://drive.google.com/a/moringaschool.com/file/d/1-S8sact6Ae-A06wntUmBBlr5NH43VLY0/view?usp=sharing))

In [4]:
# Let's load our Countries dataset below
# 
with open('Countries.csv','r') as f:
    Countries = pd.read_csv(f, index_col=0, encoding='utf-8')
#%sql DROP TABLE if EXISTS Countries;
%sql PERSIST Countries;
%sql SELECT * FROM Countries LIMIT 5;

 * sqlite://
 * sqlite://
Done.

[('Albania', 2.9, 'no', 'yes'),
 ('Andorra', 0.07, 'no', 'no'),
 ('Austria', 8.57, 'yes', 'no'),
 ('Belarus', 9.48, 'no', 'no'),
 ('Belgium', 11.37, 'yes', 'yes')]

In [6]:
# Let's load our Cities dataset below
#
with open('Cities.csv','r') as f:
    Cities = pd.read_csv(f, index_col=0, encoding='utf-8')
#%sql DROP TABLE if EXISTS Cities;
%sql PERSIST Cities;
%sql SELECT * FROM Cities LIMIT 5;

 * sqlite://
 * sqlite://
Done.

[('Aalborg', 'Denmark', 57.03, 9.92, 7.52),
 ('Aberdeen', 'United Kingdom', 57.17, -2.08, 8.1),
 ('Abisko', 'Sweden', 63.35, 18.83, 0.2),
 ('Adana', 'Turkey', 36.99, 35.32, 18.67),
 ('Albacete', 'Spain', 39.0, -1.87, 12.62)]

## 1.2 Getting Started

Let's try to learn from the given example below, then apply our learnings to the given challenges using the **`INNER JOIN`** statement;

In [7]:
# Example 1 
# First let's look at the syntax code for the inner join statement
# 
# SELECT <Column names>
# FROM table1 INNER JOIN table2
# ON table1.column_name = table2.column_name
# 
# On the first line, we select the columns from which we want to join. This columns can be from both tables.
# On the second line, we explicitly declare the tables we are joining.
# on the third line, we give the search condition. Remember, for us to be able to do inner join or any type of join, there must be a column that is a match in both tables. 
# So the search condition simply tells SQL the column that is the same in both tables


# Let's find all the cities with latitude < 50 in a country with population < 5; 
# and return the city, country, and population, sorted by country
# 
%%sql
SELECT city, Cities.country, population
FROM Cities INNER JOIN Countries
     ON Cities.country = Countries.country
WHERE latitude < 50 AND population < 5
ORDER BY Cities.country

 * sqlite://
Done.

[('Elbasan', 'Albania', 2.9),
 ('Andorra', 'Andorra', 0.07),
 ('Sarajevo', 'Bosnia and Herzegovina', 3.8),
 ('Rijeka', 'Croatia', 4.23),
 ('Split', 'Croatia', 4.23),
 ('Skopje', 'Macedonia', 2.08),
 ('Balti', 'Moldova', 4.06),
 ('Chisinau', 'Moldova', 4.06),
 ('Podgorica', 'Montenegro', 0.63),
 ('Ljubljana', 'Slovenia', 2.07)]

### <font color="green">1.2 Challenges</font>

In [12]:
# Challenge 1
# Let's find a city with temperature > 10 that belongs to the EU and doesn't have a coastline, 
# returning the city, coastline and ordered by temperature
# 
%%sql
SELECT city, Countries.coastline
FROM Cities INNER JOIN Countries
     ON Cities.country = Countries.country
WHERE temperature > 10 or EU = 'yes' or coastline = 'no'
ORDER BY Cities.temperature LIMIT 10;

 * sqlite://
Done.

[('Kiruna', 'yes'),
 ('Abisko', 'yes'),
 ('Oulu', 'yes'),
 ('Tampere', 'yes'),
 ('Uppsala', 'yes'),
 ('Helsinki', 'yes'),
 ('Tartu', 'yes'),
 ('Augsburg', 'yes'),
 ('Innsbruck', 'no'),
 ('Salzburg', 'no')]

In [13]:
# Challenge 2
# Let's find all cities with latitude > 45 in a country with no coastline and with population > 9,
# returning the city, country, latitude, and whether it's in the EU.
#
%%sql
SELECT city, Cities.country, latitude, EU
FROM Cities INNER JOIN Countries
     ON Cities.country = Countries.country
WHERE latitude > 45 or coastline = 'no' or population > 9 LIMIT 10

 * sqlite://
Done.

[('Aalborg', 'Denmark', 57.03, 'yes'),
 ('Aberdeen', 'United Kingdom', 57.17, 'yes'),
 ('Abisko', 'Sweden', 63.35, 'yes'),
 ('Adana', 'Turkey', 36.99, 'no'),
 ('Albacete', 'Spain', 39.0, 'yes'),
 ('Algeciras', 'Spain', 36.13, 'yes'),
 ('Amiens', 'France', 49.9, 'yes'),
 ('Amsterdam', 'Netherlands', 52.35, 'yes'),
 ('Ancona', 'Italy', 43.6, 'yes'),
 ('Andorra', 'Andorra', 42.5, 'no')]

In [14]:
# Challenge 3
# Let's find the average temperature of non-european cities with a latitude > 45
# 
%%sql
SELECT AVG(temperature)
FROM Cities INNER JOIN Countries
     ON Cities.country = Countries.country
WHERE latitude > 45 AND EU = 'no'

 * sqlite://
Done.

[(6.704375,)]

In [15]:
# Challenge 4 
# Let's find minimum and maxiumum temperature of european cities with latitude > 45
# 
%%sql
SELECT MAX(temperature), MIN(temperature)
FROM Cities INNER JOIN Countries
     ON Cities.country = Countries.country
WHERE latitude > 45 AND EU = 'yes'

 * sqlite://
Done.

[(11.21, -2.2)]

In [16]:
# Challenge 5
# Let's find the number of european cities with a latitude > 45
# 
%%sql
SELECT COUNT(EU)
FROM Cities INNER JOIN Countries
     ON Cities.country = Countries.country
WHERE latitude > 45

 * sqlite://
Done.

[(131,)]

In [19]:
# Challenge 6
# Which european cities belong to a country with a coastline?
# 
%%sql
SELECT city, countries.country
FROM Cities INNER JOIN Countries
     ON Cities.country = Countries.country
WHERE coastline = 'yes' LIMIT 10

 * sqlite://
Done.

[('Aalborg', 'Denmark'),
 ('Aberdeen', 'United Kingdom'),
 ('Abisko', 'Sweden'),
 ('Adana', 'Turkey'),
 ('Albacete', 'Spain'),
 ('Algeciras', 'Spain'),
 ('Amiens', 'France'),
 ('Amsterdam', 'Netherlands'),
 ('Ancona', 'Italy'),
 ('Angers', 'France')]